dependencies/multiRegionFoam/tutorials/multiRegionPlateFin/constant/fluid/HXProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      HXProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dHyd          dHyd [0 1 0 0 0 0 0]      1.29089e-03;//Hydraulic diameter
A             A    [0 2 0 0 0 0 0]      1.6038e-05;//Area for heat transfer
Ac            Ac   [0 1 0 0 0 0 0]      1.7176e-05;//Area in minimum cross-section
visc          visc [1 -1 -1 0  0 0 0]   2.0821e-05;//Dynamic viscosity
beta          beta [1 -2 -2 0 0 0 0]      (100000 0 0);//Patankar's reduced parameter as a vector
// ************************************************************************* //
